GrumpyOldPizza/arduino-STM32L4/system/STM32L4xx/Source/stm32l4_sdspi.c
    crc16 ^= (rx_crc16[0] << 8);
    crc16 ^= (rx_crc16[1] << 0);

    return crc16;
}

static inline __attribute__((optimize("O3"))) void stm32l4_sdspi_write_block(stm32l4_sdspi_t *sdspi, const uint8_t *data, uint32_t count)
{
    SPI_TypeDef *SPI = sdspi->SPI;
    uint32_t spi_cr1, spi_cr2;
    uint16_t rx_null, crc16;
    uint8_t tx_crc16[2];
    const uint8_t *data_e;

    spi_cr1  = sdspi->cr1;
    spi_cr2  = sdspi->cr2;
    
    SPI->CR1 = spi_cr1;
    SPI->CR1 = spi_cr1 | SPI_CR1_CRCEN | SPI_CR1_CRCL;
    SPI->SR  = 0;
    SPI->CR2 = spi_cr2 | SPI_CR2_DS_8BIT;
    SPI->CR1 = spi_cr1 | SPI_CR1_CRCEN | SPI_CR1_CRCL | SPI_CR1_SPE;
    
    data_e = data + count;

    stm32l4_sdspi_wr16(SPI, data);
    data += 2;
		
    stm32l4_sdspi_wr16(SPI, data);
    data += 2;

    while (data != data_e)
    {
	while (!(SPI->SR & SPI_SR_RXNE)) { }
	stm32l4_sdspi_rd16(SPI, &rx_null);
	
	stm32l4_sdspi_wr16(SPI, data);
	data += 2;
    }

    while (!(SPI->SR & SPI_SR_RXNE)) { }
    stm32l4_sdspi_rd16(SPI, &rx_null);

    while (!(SPI->SR & SPI_SR_RXNE)) { }
    stm32l4_sdspi_rd16(SPI, &rx_null);

    while (SPI->SR & SPI_SR_BSY) { }

    crc16 = SPI->TXCRCR;
    
    SPI->CR1 = spi_cr1 | SPI_CR1_CRCEN | SPI_CR1_CRCL;
    SPI->CR1 = spi_cr1;
    SPI->CR1 = spi_cr1 | SPI_CR1_SPE;

    tx_crc16[0] = crc16 >> 8;
    tx_crc16[1] = crc16 >> 0;
    
    stm32l4_sdspi_wr16(SPI, &tx_crc16[0]);

    while (!(SPI->SR & SPI_SR_RXNE)) { }
    stm32l4_sdspi_rd16(SPI, &rx_null);

    SPI->CR1 = spi_cr1;
    SPI->CR2 = spi_cr2 | SPI_CR2_DS_8BIT | SPI_CR2_FRXTH;
    SPI->CR1 = spi_cr1 | SPI_CR1_SPE;
}

static bool stm32l4_sdspi_detect(stm32l4_sdspi_t *sdspi)
{
    bool detect;

    /* This below is kind of fragile. The idea is to first set CS to 0, wait a tad
     * till the input settles to a 0. The switch the mode to input, while will make
     * the external pullup on CS take effect. If internal PULLDOWN does not work,
     * it overpowers the external pullupon CS. The delays are required to let
     * the signal on CS settle.
     */

    stm32l4_gpio_pin_write(sdspi->pins.cs, 0);
    armv7m_core_udelay(2);
    stm32l4_gpio_pin_input(sdspi->pins.cs);
    armv7m_core_udelay(2);
    detect = !!stm32l4_gpio_pin_read(sdspi->pins.cs);
    stm32l4_gpio_pin_output(sdspi->pins.cs);
    stm32l4_gpio_pin_write(sdspi->pins.cs, 1);

    return detect;
}

static void stm32l4_sdspi_select(stm32l4_sdspi_t *sdspi)
{
    SPI_TypeDef *SPI = sdspi->SPI;

    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_select);

    stm32l4_system_periph_enable(SYSTEM_PERIPH_SPI1 + sdspi->instance);
    
    SPI->CRCPR = 0x1021;
    SPI->CR2 = sdspi->cr2 | SPI_CR2_DS_8BIT | SPI_CR2_FRXTH;
    SPI->CR1 = sdspi->cr1 | SPI_CR1_SPE;

    /* CS output, drive CS to L */
    stm32l4_gpio_pin_write(sdspi->pins.cs, 0);

    /* The card will not drive DO for one more clock
     * after CS goes L, but will accept data right away.
     * The first thing after a select will be always
     * either a command (send_command), or a "Stop Token".
     * In both cases there will be a byte over the
     * bus, and hence DO will be stable.
     */
}

static void stm32l4_sdspi_deselect(stm32l4_sdspi_t *sdspi)
{
    SPI_TypeDef *SPI = sdspi->SPI;

    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_deselect);

    /* CS is output, drive CS to H */
    stm32l4_gpio_pin_write(sdspi->pins.cs, 1);

    /* The card drives the DO line at least one more
     * clock cycle after CS goes H. Hence send
     * one extra byte over the bus.
     */
    stm32l4_sdspi_data(sdspi, 0xff);

    SPI->CR1 = sdspi->cr1;

    while (SPI->SR & SPI_SR_BSY) { }

    stm32l4_system_periph_disable(SYSTEM_PERIPH_SPI1 + sdspi->instance);
}

static void stm32l4_sdspi_mode(stm32l4_sdspi_t *sdspi, uint32_t mode)
{
    SPI_TypeDef *SPI = sdspi->SPI;
    uint32_t n, speed, clock, divide;

    if (mode == STM32L4_SDSPI_MODE_NONE)
    {
	clock = 0;

	SPI->CR1 = sdspi->cr1;

	while (SPI->SR & SPI_SR_BSY) { }
	
	stm32l4_system_periph_disable(SYSTEM_PERIPH_SPI1 + sdspi->instance);

	stm32l4_gpio_pin_configure(sdspi->pins.mosi, (GPIO_PUPD_PULLUP | GPIO_OSPEED_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_INPUT));
	stm32l4_gpio_pin_configure(sdspi->pins.miso, (GPIO_PUPD_PULLUP | GPIO_OSPEED_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_INPUT));
	stm32l4_gpio_pin_configure(sdspi->pins.sck,  (GPIO_PUPD_PULLUP | GPIO_OSPEED_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_INPUT));
	stm32l4_gpio_pin_configure(sdspi->pins.cs,   (GPIO_PUPD_PULLUP | GPIO_OSPEED_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_INPUT));
	
    }
    else
    {
	stm32l4_gpio_pin_configure(sdspi->pins.mosi, (GPIO_PUPD_NONE | GPIO_OSPEED_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
	stm32l4_gpio_pin_configure(sdspi->pins.miso, (GPIO_PUPD_NONE | GPIO_OSPEED_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
	stm32l4_gpio_pin_configure(sdspi->pins.sck,  (GPIO_PUPD_NONE | GPIO_OSPEED_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_ALTERNATE));
	stm32l4_gpio_pin_configure(sdspi->pins.cs,   (GPIO_PUPD_NONE | GPIO_OSPEED_HIGH | GPIO_OTYPE_PUSHPULL | GPIO_MODE_OUTPUT));

	stm32l4_gpio_pin_write(sdspi->pins.cs, 1);

	if (mode == STM32L4_SDSPI_MODE_IDENTIFY)
	{
	    speed = 400000;
	}
	else
	{
	    speed = 25000000;
	}

	if (sdspi->instance == SPI_INSTANCE_SPI1)
	{
	    clock = stm32l4_system_pclk2() / 2;
	}
	else
	{
	    clock = stm32l4_system_pclk1() / 2;
	}

	divide = 0;
	
	while ((clock > speed) && (divide < 7))
	{
	    clock /= 2;
	    divide++;
	}
	
	sdspi->cr1 = SPI_CR1_SSM | SPI_CR1_SSI | SPI_CR1_MSTR | SPI_CR1_CPHA | SPI_CR1_CPOL | (divide << SPI_CR1_BR_Pos);
	sdspi->cr2 = 0;

	stm32l4_system_periph_enable(SYSTEM_PERIPH_SPI1 + sdspi->instance);

	SPI->CRCPR = 0x1021;
	SPI->CR2 = sdspi->cr2 | SPI_CR2_DS_8BIT | SPI_CR2_FRXTH;
	SPI->CR1 = sdspi->cr1 | SPI_CR1_SPE;
	
	if (mode == STM32L4_SDSPI_MODE_IDENTIFY)
	{
  	    stm32l4_gpio_pin_output(sdspi->pins.mosi);
	    stm32l4_gpio_pin_write(sdspi->pins.mosi, 1);

	    /* Here CS/MOSI are driven both to H.
	     *
	     * Specs says to issue 74 clock cycles in SPI mode while CS/MOSI are H,
	     * so simply send 10 bytes over the clock line.
	     */
    
	    for (n = 0; n < 10; n++)
	    {
		stm32l4_sdspi_data(sdspi, 0xff);
	    }
    
  	    stm32l4_gpio_pin_alternate(sdspi->pins.mosi);
	}

	stm32l4_gpio_pin_write(sdspi->pins.cs, 0);
    }
    
