GrumpyOldPizza/arduino-STM32L4/system/STM32L4xx/Source/stm32l4_sdspi.c
    sdspi->speed = clock;
}

/*
 * stm32l4_sdspi_wait_ready(stm32l4_sdspi_t *sdspi, uint32_t timeout)
 *
 * Wait till DO transitions from BUSY (0x00) to READY (0xff).
 */

static int stm32l4_sdspi_wait_ready(stm32l4_sdspi_t *sdspi, uint32_t timeout)
{
    int status = F_NO_ERROR;
    uint32_t millis;
    uint8_t token;

    /* While waiting for non busy (not 0x00) the host can
     * release the CS line to let somebody else access the
     * bus. However there needs to be an extra clock
     * cycle after driving CS to H for the card to release DO,
     * as well as one extra clock cycle after driving CS to L
     * before the data is valid again.
     */

    millis = armv7m_systick_millis();

    do
    {
        token = stm32l4_sdspi_data(sdspi, 0xff);

        if (token == SD_READY_TOKEN)
        {
            break;
        }

	if (((uint32_t)armv7m_systick_millis() - millis) > timeout)
	{
	    status = F_ERR_ONDRIVE;
	}
    }
    while (status == F_NO_ERROR);

    return status;
}

static int stm32l4_sdspi_command(stm32l4_sdspi_t *sdspi, uint8_t index, uint32_t argument, uint32_t wait)
{
    int status = F_NO_ERROR;
    unsigned int n;
    uint8_t data[5], response, crc7;
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_SDCARD_COMMAND_RETRIES +1;
#else /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0) */
    unsigned int retries = 0;
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0) */

    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_command);

    data[0] = 0x40 | index;
    data[1] = argument >> 24;
    data[2] = argument >> 16;
    data[3] = argument >> 8;
    data[4] = argument >> 0;

#if (DOSFS_CONFIG_SDCARD_CRC == 1)
    crc7 = (stm32l4_sdspi_compute_crc7(data, 5) << 1) | 0x01;
#else /* (DOSFS_CONFIG_SDCARD_CRC == 1) */
    if (index == SD_CMD_GO_IDLE_STATE)
    {
        crc7 = 0x95;
    }
    else if (index == SD_CMD_SEND_IF_COND)
    {
        crc7 = 0x87;
    }
    else
    {
        crc7 = 0x01;
    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) */

    do
    {
	/* A command needs at least one back to back idle cycle.
	 */
	
        stm32l4_sdspi_data(sdspi, 0xff);

	stm32l4_sdspi_data(sdspi, data[0]);
	stm32l4_sdspi_data(sdspi, data[1]);
	stm32l4_sdspi_data(sdspi, data[2]);
	stm32l4_sdspi_data(sdspi, data[3]);
	stm32l4_sdspi_data(sdspi, data[4]);
	stm32l4_sdspi_data(sdspi, crc7);

	/* NCR is 1..8 bytes, so simply always discard the first byte,
	 * and then read up to 8 bytes or till a vaild response
	 * was seen. N.b that STOP_TRANSMISSION specifies that
	 * the first byte on DataOut after reception of the command
	 * is a stuffing byte that has to be ignored. The discard
	 * takes care of that here.
	 */

	stm32l4_sdspi_data(sdspi, 0xff);

	for (n = 0; n < 8; n++)
	{
	    response = stm32l4_sdspi_data(sdspi, 0xff);
        
	    if (!(response & 0x80))
	    {
		/*
		 * A STOP_TRANSMISSION can be issued before the card
		 * had send a "Data Error Token" for that last block
		 * that we are not really intrested in. This could result
		 * in a "Parameter Error" if the next block is out of bounds.
		 * Due to the way CMD_STOP_TRANSMISSION gets send there is
		 * also the chance it gets an "Illegal Command" error ...
		 */
		if (index == SD_CMD_STOP_TRANSMISSION)
		{
		    response &= ~(SD_R1_ILLEGAL_COMMAND | SD_R1_PARAMETER_ERROR);
		}
		break;
	    }
	}

	sdspi->response[0] = response;

	/* Always read the rest of the data to avoid synchronization
	 * issues. Worst case the data read is random.
	 */
	for (n = 1; n <= wait; n++)
	{
	    sdspi->response[n] = stm32l4_sdspi_data(sdspi, 0xff);
	} 

	if (response & 0x88)
	{
	    if (response & 0x80)
	    {
		STM32L4_SDSPI_STATISTICS_COUNT(sdcard_command_timeout);

#if (DOSFS_CONFIG_STATISTICS == 1)
		sdspi->statistics.sdcard_command_timeout_2[index]++;
#endif
	    }
	    else
	    {
		STM32L4_SDSPI_STATISTICS_COUNT(sdcard_command_crcfail);

#if (DOSFS_CONFIG_STATISTICS == 1)
		sdspi->statistics.sdcard_command_crcfail_2[index]++;
#endif
	    }

#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0)
	    if (retries > 1)
	    {
	        stm32l4_gpio_pin_write(sdspi->pins.cs, 1);
	        stm32l4_gpio_pin_write(sdspi->pins.cs, 0);

		STM32L4_SDSPI_STATISTICS_COUNT(sdcard_command_retry);
		    
		retries--;
	    }
	    else
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_COMMAND_RETRIES != 0) */
	    {
		status = F_ERR_ONDRIVE;

		retries = 0;
	    }
	}
	else
	{
	    if ((index != SD_CMD_STOP_TRANSMISSION) && (index != SD_CMD_SEND_STATUS))
	    {
		if (response & SD_R1_ERROR_MASK)
		{
		    status = F_ERR_ONDRIVE;
		}
	    }

	    retries = 0;
	}
    }
    while (retries != 0);

    if (status != F_NO_ERROR)
    {
	STM32L4_SDSPI_STATISTICS_COUNT(sdcard_command_fail);

#if (DOSFS_CONFIG_STATISTICS == 1)
	sdspi->statistics.sdcard_command_fail_2[index]++;
#endif
    }

    return status;
}

static int stm32l4_sdspi_receive(stm32l4_sdspi_t *sdspi, uint8_t *data, uint32_t count, uint32_t *p_count)
{
    int status = F_NO_ERROR;
    uint8_t token;
    uint16_t crc16;
    uint32_t total, blksz, millis;

    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_receive);

    total = count;
    blksz = (count >= 512) ? 512 : count;

    millis = armv7m_systick_millis();

    do
    {
	/* If a "Start Block Token" (0xfe) zips by then
	 * a data block will follow. Otherwise a "Data Error Token"
	 * shows up:
	 *
	 * 0x01 Execution Error
	 * 0x02 CC Error
	 * 0x04 Card ECC failed
	 * 0x08 Out of Range
	 *
	 * The maximum documented timeout is 100ms for SDHC.
	 */

	token = stm32l4_sdspi_data(sdspi, 0xff);

	if (token == SD_START_READ_TOKEN)
	{
	    crc16 = stm32l4_sdspi_read_block(sdspi, data, blksz);
	    
#if (DOSFS_CONFIG_SDCARD_CRC == 1)
	    if (crc16 != 0)
	    {
	        STM32L4_SDSPI_STATISTICS_COUNT(sdcard_receive_crcfail);

		/* On a CRC error always send a STOP_TRANSMISSION, just to make sure.
		 */
		status = stm32l4_sdspi_command(sdspi, SD_CMD_STOP_TRANSMISSION, 0, 0);
		
		if (status == F_NO_ERROR)
		{
		    sdspi->state = STM32L4_SDSPI_STATE_READY;
		}

		break;
	    }
	    else
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1)  */
	    {
		data  += blksz;
		total -= blksz;

		millis = armv7m_systick_millis();
	    }
	}

	else if ((token & SD_DATA_ERROR_TOKEN_VALID_MASK) == SD_DATA_ERROR_TOKEN_VALID_DATA)
	{
	    sdspi->state = STM32L4_SDSPI_STATE_READY;

	    if (token & SD_DATA_ERROR_CARD_ECC_FAILED)
	    {
		status = F_ERR_INVALIDSECTOR;
	    }
	    else
	    {
		status = F_ERR_ONDRIVE;
	    }
	}

	else
	{
	    if (((uint32_t)armv7m_systick_millis() - millis) > 100)
	    {
	        STM32L4_SDSPI_STATISTICS_COUNT(sdcard_receive_timeout);

		status = F_ERR_ONDRIVE;
	    }
	}
    }
    while ((status == F_NO_ERROR) && total);
	
