GrumpyOldPizza/arduino-STM32L4/system/STM32L4xx/Source/stm32l4_sdspi.c
    *p_count = (count - total);

    if (status != F_NO_ERROR)
    {
	STM32L4_SDSPI_STATISTICS_COUNT(sdcard_receive_fail);
    }

    return status;
}

static int stm32l4_sdspi_transmit(stm32l4_sdspi_t *sdspi, uint8_t start, const uint8_t *data, uint32_t count, bool *p_check)
{
    int status = F_NO_ERROR;
    uint8_t token, response;
    uint32_t total, blksz, millis;

    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_transmit);

    *p_check = false;

    total = count;
    blksz = (count >= 512) ? 512 : count;

    millis = armv7m_systick_millis();

    do
    {
        token = stm32l4_sdspi_data(sdspi, 0xff);

        if (token == SD_READY_TOKEN)
        {
	    stm32l4_sdspi_data(sdspi, start);
	    stm32l4_sdspi_write_block(sdspi, data, blksz);

	    /* At last read back the "Data Response Token":
	     *
	     * 0x05 No Error
	     * 0x0b CRC Error
	     * 0x0d Write Error
	     */
	    
	    response = stm32l4_sdspi_data(sdspi, 0xff) & SD_DATA_RESPONSE_MASK;

	    if (response != SD_DATA_RESPONSE_ACCEPTED)
	    {
		*p_check = true;

		status = stm32l4_sdspi_command(sdspi, SD_CMD_STOP_TRANSMISSION, 0, 1);

		if (status != F_NO_ERROR)
		{
		    status = stm32l4_sdspi_command(sdspi, SD_CMD_STOP_TRANSMISSION, 0, 1);
		}

		if (status == F_NO_ERROR)
		{
		    status = stm32l4_sdspi_wait_ready(sdspi, 250);
		    
		    if (status == F_NO_ERROR)
		    {
			sdspi->state = STM32L4_SDSPI_STATE_READY;

			if (response == SD_DATA_RESPONSE_CRC_ERROR)
			{
			    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_transmit_crcfail);
			}
			else
			{
			    status = stm32l4_sdspi_command(sdspi, SD_CMD_SEND_STATUS, 0, 1);
			    
			    if (status == F_NO_ERROR)
			    {
				if ((sdspi->response[0] & SD_R1_ERROR_MASK) || (sdspi->response[1] & SD_R2_ERROR_MASK))
				{
				    if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP))
				    {
					status = F_ERR_WRITEPROTECT;
				    }
				    else if (sdspi->response[1] & SD_R2_CARD_ECC_FAILED)
				    {
					status = F_ERR_INVALIDSECTOR;
				    }
				    else
				    {
					status = F_ERR_ONDRIVE;
				    }
				}
			    }
			}
		    }
		}

		break;
	    }
	    else
	    {
		data  += blksz;
		total -= blksz;
		
		millis = armv7m_systick_millis();
	    }
	}
	else
	{
	    if (((uint32_t)armv7m_systick_millis() - millis) > 250)
	    {
	        STM32L4_SDSPI_STATISTICS_COUNT(sdcard_transmit_timeout);

		status = F_ERR_ONDRIVE;
	    }
	}
    }
    while ((status == F_NO_ERROR) && total);

    if (status != F_NO_ERROR)
    {
	STM32L4_SDSPI_STATISTICS_COUNT(sdcard_transmit_fail);
    }

    return status;
}

static int stm32l4_sdspi_read_stop(stm32l4_sdspi_t *sdspi)
{
    int status = F_NO_ERROR;

    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_read_stop);

    status = stm32l4_sdspi_command(sdspi, SD_CMD_STOP_TRANSMISSION, 0, 0);

    if (status == F_NO_ERROR)
    {
	sdspi->state = STM32L4_SDSPI_STATE_READY;

	if (sdspi->response[0] & SD_R1_ERROR_MASK)
	{
	    status = stm32l4_sdspi_command(sdspi, SD_CMD_SEND_STATUS, 0, 1);
				
	    if (status == F_NO_ERROR)
	    {
		if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP))
		{
		    status = F_ERR_WRITEPROTECT;
		}
		else if (sdspi->response[1] & SD_R2_CARD_ECC_FAILED)
		{
		    status = F_ERR_INVALIDSECTOR;
		}
		else
		{
		    status = F_ERR_ONDRIVE;
		}
	    }
	}
    }
				
    return status;
}

static int stm32l4_sdspi_write_stop(stm32l4_sdspi_t *sdspi)
{
    int status = F_NO_ERROR;

    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_write_stop);

    /* There need to be 8 clocks before the "Stop Transfer Token",
     * and 8 clocks after it, before the card signals busy properly.
     * The 8 clocks before are covered by stm32l4_sdspi_wait_ready().
     */

    status = stm32l4_sdspi_wait_ready(sdspi, 250);
    
    if (status == F_NO_ERROR)
    {
	stm32l4_sdspi_data(sdspi, SD_STOP_TRANSMISSION_TOKEN);
	stm32l4_sdspi_data(sdspi, 0xff);

	sdspi->state = STM32L4_SDSPI_STATE_WRITE_STOP;
    }

    return status;
}

static int stm32l4_sdspi_write_sync(stm32l4_sdspi_t *sdspi)
{
    int status = F_NO_ERROR;

    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_write_sync);

    status = stm32l4_sdspi_wait_ready(sdspi, 250);

    if (status == F_NO_ERROR)
    {
	sdspi->state = STM32L4_SDSPI_STATE_READY;

	status = stm32l4_sdspi_command(sdspi, SD_CMD_SEND_STATUS, 0, 1);
	
	if (status == F_NO_ERROR)
	{
	    if ((sdspi->response[0] & SD_R1_ERROR_MASK) || (sdspi->response[1] & SD_R2_ERROR_MASK))
	    {
		if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP | SD_R2_CARD_ECC_FAILED))
		{
		    if (sdspi->response[1] & (SD_R2_WP_VIOLATION | SD_R2_WP_ERASE_SKIP))
		    {
			status = F_ERR_WRITEPROTECT;
		    }
		    else
		    {
			status = F_ERR_INVALIDSECTOR;
		    }

		    if (sdspi->p_status != NULL)
		    {
			if (*sdspi->p_status == F_NO_ERROR)
			{
			    *sdspi->p_status = status;
			}
			
			status = F_NO_ERROR;
		    }
		}
		else
		{
		    status = F_ERR_ONDRIVE;
		}
	    }
	}
    }

    if (status != F_NO_ERROR)
    {
      STM32L4_SDSPI_STATISTICS_COUNT(sdcard_write_sync_fail);
    }

    sdspi->p_status = NULL;
    
    return status;
}

static int stm32l4_sdspi_idle(stm32l4_sdspi_t *sdspi, uint32_t *p_media)
{
    int status = F_NO_ERROR;
    uint32_t media;
    unsigned int n;

    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_idle);

    media = DOSFS_MEDIA_NONE;
    
    stm32l4_sdspi_mode(sdspi, STM32L4_SDSPI_MODE_IDENTIFY);

    /* Apply an initial CMD_GO_IDLE_STATE, so that the card is out of
     * data read/write mode, and can properly respond.
     */

    stm32l4_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);

    if (sdspi->response[0] != 0x01)
    {
	/* There could be 2 error scenarios. One is that the
	 * CMD_GO_IDLE_STATE was send while the card was waiting
	 * for the next "Start Block" / "Stop Transmission" token.
	 * The card will answer that normally by signaling BUSY,
	 * when means there would be a 0x00 response.
	 * The other case is that there was a reset request while
	 * being in the middle of a write transaction. As a result
	 * the card will send back a stream of non-zero values
	 * (READY or a "Data Response Token"), which can be handled
	 * by simple flushing the transaction (CRC will take care of
	 * rejecting the data ... without CRC the last write will be
	 * garbage.
	 *
	 * Hence first drain a possible write command, and then
	 * rety CMD_GO_IDLE_STATE after a dosfs_sdcard_wait_ready().
	 * If the card is still in BUSY mode, then retry the
	 * CMD_GO_IDLE_STATE again.
	 */

	if (sdspi->response[0] != 0x00)
	{
	    for (n = 0; n < 1024; n++)
	    {
		stm32l4_sdspi_data(sdspi, 0xff);
	    }

	    stm32l4_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);
	}

