GrumpyOldPizza/arduino-STM32L4/system/STM32L4xx/Source/stm32l4_sdspi.c
	stm32l4_sdspi_wait_ready(sdspi, 250);
	    
	stm32l4_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);

	if (sdspi->response[0] == 0x00)
	{
	    stm32l4_sdspi_wait_ready(sdspi, 250);
	    
	    stm32l4_sdspi_command(sdspi, SD_CMD_GO_IDLE_STATE, 0, 0);
	}
    }

    if (sdspi->response[0] == 0x01)
    {
	stm32l4_sdspi_command(sdspi, SD_CMD_SEND_IF_COND, 0x000001aa, 4);

	if (sdspi->response[0] == 0x01)
	{
	    if ((sdspi->response[1] == 0x00) &&
		(sdspi->response[2] == 0x00) &&
		(sdspi->response[3] == 0x01) &&
		(sdspi->response[4] == 0xaa))
	    {
		media = DOSFS_MEDIA_SDHC;
	    }
	    else
	    {
		status = F_ERR_INVALIDMEDIA;
	    }
	}
	else
	{
	    media = DOSFS_MEDIA_SDSC;
	}
    }

    if (status == F_NO_ERROR)
    {
	status = stm32l4_sdspi_command(sdspi, SD_CMD_READ_OCR, 0x00000000, 4);

	if (status == F_NO_ERROR)
	{
	    sdspi->OCR = ((sdspi->response[1] << 24) |
			  (sdspi->response[2] << 16) |
			  (sdspi->response[3] <<  8) |
			  (sdspi->response[4] <<  0));
	    
	    if (!(sdspi->OCR & 0x00300000))
	    {
		status = F_ERR_INVALIDMEDIA;
	    }
	}
    }

    if ((p_media == NULL) || (status != F_NO_ERROR))
    {
	stm32l4_sdspi_mode(sdspi, STM32L4_SDSPI_MODE_NONE);
    }
    
    if (p_media)
    {
	*p_media = media;
    }

    return status;
}

static uint32_t stm32l4_sdspi_au_size_table[16] = {
    0,
    32,      /* 16KB  */
    64,      /* 32KB  */
    128,     /* 64KB  */
    256,     /* 128KB */
    512,     /* 256KB */
    1024,    /* 512KB */
    2048,    /* 1MB   */
    4096,    /* 2MB   */
    8192,    /* 4MB   */
    16384,   /* 8MB   */
    24576,   /* 12MB  */
    32768,   /* 16MB  */
    49152,   /* 24MB  */
    65536,   /* 32MB  */
    131072,  /* 64MB  */
};

static int stm32l4_sdspi_reset(stm32l4_sdspi_t *sdspi, uint32_t media)
{
    int status = F_NO_ERROR;
    uint32_t millis, count;

    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_reset);

    /* Send ACMD_SD_SEND_OP_COND, and wait till the initialization process is done. The SDCARD has
     * 1000ms to complete this initialization process.
     */

    millis = armv7m_systick_millis();
    
    do
    {
	status = stm32l4_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);
	    
	if (status == F_NO_ERROR)
	{
	    status = stm32l4_sdspi_command(sdspi, SD_ACMD_SD_SEND_OP_COND, ((media == DOSFS_MEDIA_SDHC) ? 0x40300000 : 0x00300000), 0);
		
	    if (status == F_NO_ERROR)
	    {
		if (!(sdspi->response[0] & SD_R1_IN_IDLE_STATE))
		{
		    break;
		}
		    
		if (((uint32_t)armv7m_systick_millis() - millis) > 1000)
		{
		    status = F_ERR_ONDRIVE;
		}
	    }
	}
    }
    while (status == F_NO_ERROR);

    if (status == F_NO_ERROR)
    {
	if (media == DOSFS_MEDIA_SDHC)
	{
	    status = stm32l4_sdspi_command(sdspi, SD_CMD_READ_OCR, 0x00000000, 4);
	    
	    if (status == F_NO_ERROR)
	    {
		sdspi->OCR = ((sdspi->response[1] << 24) |
			      (sdspi->response[2] << 16) |
			      (sdspi->response[3] <<  8) |
			      (sdspi->response[4] <<  0));
		
		if (sdspi->OCR & 0x40000000)
		{
		    media = DOSFS_MEDIA_SDHC;
		}
		else
		{
		    media = DOSFS_MEDIA_SDSC;
		}
	    }
	}
    }

    /* If we got here without a hitch then it's time to enter transfer mode
     * and setup buswidth and speed.
     */

    if (status == F_NO_ERROR)
    {
	stm32l4_sdspi_mode(sdspi, STM32L4_SDSPI_MODE_DATA_TRANSFER);

#if (DOSFS_CONFIG_SDCARD_CRC == 1)
	if (status == F_NO_ERROR)
	{
	    status  = stm32l4_sdspi_command(sdspi, SD_CMD_CRC_ON_OFF, 1, 0);
	}
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) */

	status = stm32l4_sdspi_command(sdspi, SD_CMD_SEND_CID, 0, 0);
	
	if (status == F_NO_ERROR)
	{
	    status = stm32l4_sdspi_receive(sdspi, &sdspi->CID[0], 16, &count);
	    
	    if ((status == F_NO_ERROR) && (count != 16))
	    {
		status = F_ERR_READ;
	    }
	}
	
	if (status == F_NO_ERROR)
	{
	    status = stm32l4_sdspi_command(sdspi, SD_CMD_SEND_CSD, 0, 0);
	    
	    if (status == F_NO_ERROR)
	    {
		status = stm32l4_sdspi_receive(sdspi, &sdspi->CSD[0], 16, &count);
		
		if ((status == F_NO_ERROR) && (count != 16))
		{
		    status = F_ERR_READ;
		}
	    }
	}

	if (status == F_NO_ERROR)
	{
	    status = stm32l4_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);
		
	    if (status == F_NO_ERROR)
	    {
		status = stm32l4_sdspi_command(sdspi, SD_ACMD_SEND_SCR, 0, 0);

		if (status == F_NO_ERROR)
		{
		    status = stm32l4_sdspi_receive(sdspi, &sdspi->SCR[0], 8, &count);
		    
		    if ((status == F_NO_ERROR) && (count != 8))
		    {
			status = F_ERR_READ;
		    }
		}
	    }
	}
	
	if (status == F_NO_ERROR)
	{
	    status = stm32l4_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);
		
	    if (status == F_NO_ERROR)
	    {
		status = stm32l4_sdspi_command(sdspi, SD_ACMD_SD_STATUS, 0, 1);

		if (status == F_NO_ERROR)
		{
		    status = stm32l4_sdspi_receive(sdspi, &sdspi->SSR[0], 64, &count);
		    
		    if ((status == F_NO_ERROR) && (count != 64))
		    {
			status = F_ERR_READ;
		    }
		}
	    }
	}
	
	if (status == F_NO_ERROR)
	{
	    status = stm32l4_sdspi_command(sdspi, SD_CMD_SET_BLOCKLEN, 512, 0);
	}
    }

    if (status == F_NO_ERROR)
    {
	sdspi->state = STM32L4_SDSPI_STATE_READY;

	sdspi->media = media;
	sdspi->shift = 9;
	sdspi->au_size = 0;
	sdspi->erase_size = 0;
	sdspi->erase_timeout = 0;
	sdspi->erase_offset = 0;

	if (media == DOSFS_MEDIA_SDHC)
	{
	    sdspi->shift = 0;
	    sdspi->au_size = stm32l4_sdspi_au_size_table[stm32l4_sdspi_slice(sdspi->SSR, 512, 428, 4)];
	    sdspi->erase_size = stm32l4_sdspi_slice(sdspi->SSR, 512, 408, 16);
	    sdspi->erase_timeout = stm32l4_sdspi_slice(sdspi->SSR, 512, 402, 6) * 1000;
	    sdspi->erase_offset = stm32l4_sdspi_slice(sdspi->SSR, 512, 400, 2) * 1000;

	    if (!sdspi->au_size || !sdspi->erase_size || !sdspi->erase_timeout)
	    {
		sdspi->erase_size = 0;
		sdspi->erase_timeout = 0;
		sdspi->erase_offset = 0;
	    }
	}

	STM32L4_SDSPI_STATISTICS_COUNT(sdcard_select);
    }
    else
    {
	sdspi->state = STM32L4_SDSPI_STATE_RESET;
	
	stm32l4_sdspi_mode(sdspi, STM32L4_SDSPI_MODE_NONE);

	status = F_ERR_CARDREMOVED;
    }
    
    sdspi->p_status = NULL;

