GrumpyOldPizza/arduino-STM32L4/system/STM32L4xx/Source/stm32l4_sdspi.c
    return status;
}

static int stm32l4_sdspi_discard(void *context, uint32_t address, uint32_t length)
{
    return F_NO_ERROR;
}

static int stm32l4_sdspi_read(void *context, uint32_t address, uint8_t *data, uint32_t length, bool prefetch)
{
    stm32l4_sdspi_t *sdspi = (stm32l4_sdspi_t*)context;
    int status = F_NO_ERROR;
    uint32_t count;
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */

    if (!prefetch && (length == 1))
    {
	status = stm32l4_sdspi_lock(sdspi, STM32L4_SDSPI_STATE_READY, 0);

	if (status == F_NO_ERROR)
	{
	    do
	    {
		status = stm32l4_sdspi_command(sdspi, SD_CMD_READ_SINGLE_BLOCK, (address << sdspi->shift), 1);

		if (status == F_NO_ERROR)
		{
		    status = stm32l4_sdspi_receive(sdspi, data, DOSFS_BLK_SIZE, &count);
		    
		    if (status == F_NO_ERROR)
		    {
			if (count != DOSFS_BLK_SIZE)
			{
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
			    if (retries)
			    {
				STM32L4_SDSPI_STATISTICS_COUNT(sdcard_receive_retry);
				
				retries--;
				
				continue;
			    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
			    
			    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_receive_fail);
			    
			    status = F_ERR_READ;
			}
			else
			{
			    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_read_single);
			    
			    data += DOSFS_BLK_SIZE;
			    
			    address++;
			    length--;
			}
		    }
		}
	    }
	    while ((status == F_NO_ERROR) && length);

	    status = stm32l4_sdspi_unlock(sdspi, status);
	}
    }
    else
    {
	if (prefetch)
	{
	    status = stm32l4_sdspi_lock(sdspi, STM32L4_SDSPI_STATE_READ_MULTIPLE, address);
	}
	else
	{
	    status = stm32l4_sdspi_lock(sdspi, STM32L4_SDSPI_STATE_READY, 0);
	}

	if (status == F_NO_ERROR)
	{
	    do
	    {
		if (sdspi->state != STM32L4_SDSPI_STATE_READ_MULTIPLE)
		{
		    status = stm32l4_sdspi_command(sdspi, SD_CMD_READ_MULTIPLE_BLOCK, (address << sdspi->shift), 1);

		    if (status == F_NO_ERROR)
		    {
			sdspi->state = STM32L4_SDSPI_STATE_READ_MULTIPLE;
			sdspi->address = address;
			sdspi->count = 0;
		    }
		}

		if (status == F_NO_ERROR)
		{
		    status = stm32l4_sdspi_receive(sdspi, data, length * DOSFS_BLK_SIZE, &count);
	    
		    if (status == F_NO_ERROR)
		    {
			count /= DOSFS_BLK_SIZE;
			
			STM32L4_SDSPI_STATISTICS_COUNT_N(sdcard_read_multiple, count);
			
			if (length != count)
			{
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
			    data += (DOSFS_BLK_SIZE * count);
			    
			    address += count;
			    length -= count;
			    
			    if (count)
			    {
				STM32L4_SDSPI_STATISTICS_COUNT(sdcard_receive_retry);
				
				retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
				
				continue;
			    }
			    else
			    {
				if (retries)
				{
				    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_receive_retry);
				    
				    retries--;
				    
				    continue;
				}
			    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
			    
			    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_receive_fail);
			    
			    status = F_ERR_READ;
			}
			else
			{
			    sdspi->address += length;
			    sdspi->count += length;

			    length = 0;

			    if (!prefetch)
			    {
				status = stm32l4_sdspi_read_stop(sdspi);
			    }
			}
		    }
		}
	    }
	    while ((status == F_NO_ERROR) && length);
	    
	    status = stm32l4_sdspi_unlock(sdspi, status);
	}
    }

    return status;
}

static int stm32l4_sdspi_write(void *context, uint32_t address, const uint8_t *data, uint32_t length, volatile uint8_t *p_status)
{
    stm32l4_sdspi_t *sdspi = (stm32l4_sdspi_t*)context;
    int status = F_NO_ERROR;
    bool check;
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
    unsigned int retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */

    if ((p_status == NULL) && (length == 1))
    {
	status = stm32l4_sdspi_lock(sdspi, STM32L4_SDSPI_STATE_READY, 0);

	if (status == F_NO_ERROR)
	{
	    sdspi->p_status = p_status;

	    do
	    {
		status = stm32l4_sdspi_command(sdspi, SD_CMD_WRITE_SINGLE_BLOCK, (address << sdspi->shift), 0);
	    
		if (status == F_NO_ERROR)
		{
		    status = stm32l4_sdspi_transmit(sdspi, SD_START_WRITE_SINGLE_TOKEN, data, DOSFS_BLK_SIZE, &check);
		
		    if (status == F_NO_ERROR)
		    {
			sdspi->state = STM32L4_SDSPI_STATE_WRITE_STOP;

			if (check)
			{
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
			    if (retries)
			    {
				STM32L4_SDSPI_STATISTICS_COUNT(sdcard_transmit_retry);
			    
				retries--;
			    
				continue;
			    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
			
			    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_transmit_fail);
			
			    status = F_ERR_WRITE;
			}
			else
			{
			    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_write_single);
			
			    address++;
			    length--;

			    status = stm32l4_sdspi_write_sync(sdspi);
			}
		    }
		}
	    }
	    while ((status == F_NO_ERROR) && length);

	    status = stm32l4_sdspi_unlock(sdspi, status);
	}
    }
    else
    {
	status = stm32l4_sdspi_lock(sdspi, STM32L4_SDSPI_STATE_WRITE_MULTIPLE, address);

	if (status == F_NO_ERROR)
	{
	    sdspi->p_status = p_status;

	    do
	    {
		if (sdspi->state != STM32L4_SDSPI_STATE_WRITE_MULTIPLE)
		{
		    status = stm32l4_sdspi_command(sdspi, SD_CMD_WRITE_MULTIPLE_BLOCK, (address << sdspi->shift), 0);
			
		    if (status == F_NO_ERROR)
		    {
			sdspi->state = STM32L4_SDSPI_STATE_WRITE_MULTIPLE;
			sdspi->address = address;
			sdspi->count = 0;
		    }
		}

		if (status == F_NO_ERROR)
		{
		    status = stm32l4_sdspi_transmit(sdspi, SD_START_WRITE_MULTIPLE_TOKEN, data, length * DOSFS_BLK_SIZE, &check);

		    if (status == F_NO_ERROR)
		    {
			if (check)
			{
#if (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0)
			    uint32_t count, offset;
			    uint8_t temp[4];
				
			    status = stm32l4_sdspi_command(sdspi, SD_CMD_APP_CMD, 0, 0);
				
			    if (status == F_NO_ERROR)
			    {
				status = stm32l4_sdspi_command(sdspi, SD_ACMD_SEND_NUM_WR_BLOCKS, 0, 0);

				if (status == F_NO_ERROR)
				{
				    status = stm32l4_sdspi_receive(sdspi, &temp[0], 4, &count);
				    
				    if (status == F_NO_ERROR)
				    {
					if (count == 4)
					{
					    offset = (((uint32_t)temp[0] << 24) |
						      ((uint32_t)temp[1] << 16) |
						      ((uint32_t)temp[2] <<  8) |
						      ((uint32_t)temp[3] <<  0));

