GrumpyOldPizza/arduino-STM32L4/system/STM32L4xx/Source/stm32l4_sdspi.c
					    if (offset >= sdspi->count)
					    {
						offset -= sdspi->count;

						STM32L4_SDSPI_STATISTICS_COUNT_N(sdcard_write_multiple, offset);
				    
						data += (offset * DOSFS_BLK_SIZE);
				    
						address += offset;
						length -= offset;

						if (offset)
						{
						    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_transmit_retry);
						    
						    retries = DOSFS_CONFIG_SDCARD_DATA_RETRIES;
						    
						    continue;
						}
						else
						{
						    if (retries)
						    {
							STM32L4_SDSPI_STATISTICS_COUNT(sdcard_transmit_retry);
							
							retries--;
							
							continue;
						    }
						}
					    }
					}
				    }
				}
			    }
#endif /* (DOSFS_CONFIG_SDCARD_CRC == 1) && (DOSFS_CONFIG_SDCARD_DATA_RETRIES != 0) */
				
			    STM32L4_SDSPI_STATISTICS_COUNT(sdcard_transmit_fail);
			
			    status = F_ERR_WRITE;
			}
			else
			{
			    STM32L4_SDSPI_STATISTICS_COUNT_N(sdcard_write_multiple, length);

			    sdspi->address += length;
			    sdspi->count += length;

			    length = 0;

			    if (p_status == NULL)
			    {
				status = stm32l4_sdspi_write_stop(sdspi);
				
				if (status == F_NO_ERROR)
				{
				    status = stm32l4_sdspi_write_sync(sdspi);
				}
			    }
			}
		    }
		}
	    }
	    while ((status == F_NO_ERROR) && length);
	
	    status = stm32l4_sdspi_unlock(sdspi, status);
	}
    }

    return status;
}

static int stm32l4_sdspi_sync(void *context, bool wait)
{
    stm32l4_sdspi_t *sdspi = (stm32l4_sdspi_t*)context;
    int status = F_NO_ERROR;

    if (sdspi->state >= STM32L4_SDSPI_STATE_READ_MULTIPLE)
    {
	if ((sdspi->state == STM32L4_SDSPI_STATE_WRITE_MULTIPLE) && !wait)
	{
	    status = stm32l4_sdspi_lock(sdspi, STM32L4_SDSPI_STATE_WRITE_STOP, 0);
	}
	else
	{
	    status = stm32l4_sdspi_lock(sdspi, STM32L4_SDSPI_STATE_READY, 0);
	}

	if (status == F_NO_ERROR)
	{
	    status = stm32l4_sdspi_unlock(sdspi, status);
	}
    }

    return status;
}

static const dosfs_device_interface_t stm32l4_sdspi_interface = {
    stm32l4_sdspi_release,
    stm32l4_sdspi_info,
    stm32l4_sdspi_format,
    stm32l4_sdspi_erase,
    stm32l4_sdspi_discard,
    stm32l4_sdspi_read,
    stm32l4_sdspi_write,
    stm32l4_sdspi_sync,
};

int stm32l4_sdspi_initialize(void)
{
    stm32l4_sdspi_t *sdspi = (stm32l4_sdspi_t*)&stm32l4_sdspi;
    int status = F_NO_ERROR;

    dosfs_device.lock = DOSFS_DEVICE_LOCK_INIT;
    dosfs_device.context = (void*)sdspi;
    dosfs_device.interface = &stm32l4_sdspi_interface;

    sdspi->option = 0;

    if (sdspi->state == STM32L4_SDSPI_STATE_NONE)
    {
#if defined(STM32L476xx)
	sdspi->instance  = SPI_INSTANCE_SPI3;
	sdspi->pins.mosi = GPIO_PIN_PC12_SPI3_MOSI;
	sdspi->pins.miso = GPIO_PIN_PC11_SPI3_MISO;
	sdspi->pins.sck  = GPIO_PIN_PC10_SPI3_SCK;
	sdspi->pins.cs   = GPIO_PIN_PD2;
	sdspi->SPI       = SPI3;
#else
	sdspi->instance  = SPI_INSTANCE_SPI1;
	sdspi->pins.mosi = GPIO_PIN_PA7_SPI1_MOSI;
	sdspi->pins.miso = GPIO_PIN_PA6_SPI1_MISO;
	sdspi->pins.sck  = GPIO_PIN_PA1_SPI1_SCK;
	sdspi->pins.cs   = GPIO_PIN_PA8;
	sdspi->SPI       = SPI1;
#endif

	/* Try GO_IDLE after a reset, as the SDCARD could be still
	 * powered during the reset.
	 */
	stm32l4_sdspi_idle(sdspi, NULL);

	sdspi->state = STM32L4_SDSPI_STATE_INIT;
    }
    
    dosfs_device.lock = 0;

    return status;
}
